tap "oven-sh/bun"

brew "node"
brew "oven-sh/bun/bun"
brew "pnpm"
brew "starship"
brew "stow"
cask "appcleaner"
cask "brainfm"
cask "claude-code"
cask "github"

unless File.exist?(File.expand_path("~/.dotfiles/work_mode"))
  cask "brave-browser"
  cask "chatgpt"
  cask "claude"
  cask "cursor"
  cask "figma"
  cask "google-chrome"
  cask "notion"
  cask "openra"
  cask "plex"
  cask "protonvpn"
  cask "rive"
  cask "visual-studio-code"
end
