# Homebrew taps
tap "oven-sh/bun"

# CLI tools
brew "node"
brew "pnpm"
brew "oven-sh/bun/bun"

# Apps (Casks)
cask "appcleaner"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "cursor"
cask "figma"
cask "github"
cask "google-chrome"
cask "linear-linear"
cask "notion"
cask "openra"
cask "plex"
cask "protonvpn"
cask "rive"
cask "visual-studio-code"
cask "zoom"

# VS code extensions
vscode "aaron-bond.better-comments"
vscode "bradlc.vscode-tailwindcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "mikestead.dotenv"
vscode "ms-vscode.vscode-speech"
vscode "openai.chatgpt"
vscode "origin-space.shadcn-color-tool"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "yoavbls.pretty-ts-errors"