# CLI tools
brew "bun"
brew "node"
brew "starship" # Shell prompt
brew "stow" # Symlink manager

# Apps (Casks)
cask "appcleaner"
cask "brainfm"
cask "brave-browser"
cask "chatgpt"
cask "cursor"
cask "figma"
cask "github"
cask "google-chrome"
cask "linear-linear"
cask "notion"
cask "openra"
cask "plex"
cask "protonvpn"
cask "rive"
cask "visual-studio-code"

# VS Code extensions
vscode "aaron-bond.better-comments"
vscode "bradlc.vscode-tailwindcss"
vscode "editorconfig.editorconfig"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "ms-vscode.vscode-speech"
vscode "oven.bun-vscode"  
vscode "oxc.oxc-vscode"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "vscode-icons-team.vscode-icons"